---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.JoistSystemJustificationParam
source: html/80f56b2f-2c25-2c70-e2fc-8f9f25a53f3c.htm
---
# Autodesk.Revit.DB.ParameterTypeId.JoistSystemJustificationParam Property

"Justification"

## Syntax (C#)
```csharp
public static ForgeTypeId JoistSystemJustificationParam { get; }
```